In [12]:
import pandas as pd
data = pd.read_csv("C:\\Users\\acorn-519\\Desktop\\sampledata\\10_phone_data.csv", parse_dates=True)

data.head()

   index            date  duration  item    month   network network_type
0      0  15/10/14 06:58    34.429  data  2014-11      data         data
1      1  15/10/14 06:58    13.000  call  2014-11  Vodafone       mobile
2      2  15/10/14 14:46    23.000  call  2014-11    Meteor       mobile
3      3  15/10/14 14:48     4.000  call  2014-11     Tesco       mobile
4      4  15/10/14 17:27     4.000  call  2014-11     Tesco       mobile

In [9]:
import dateutil

In [13]:
import pandas as pd
data = pd.read_csv("C:\\Users\\acorn-519\\Desktop\\sampledata\\10_phone_data.csv")
date["date"]=data["date"].apply(dateutil.parser.parse,dayfirst = True)

data.head()

NameError: name 'date' is not defined

In [11]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 830 entries, 0 to 829
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   index         830 non-null    int64
 1   date          830 non-null    object
 2   duration      830 non-null    float64
 3   item          830 non-null    object
 4   month         830 non-null    object
 5   network       830 non-null    object
 6   network_type  830 non-null    object
dtypes: float64(1), int64(1), object(5)
memory usage: 45.5+ KB

In [14]:
data["item"].value_counts()

call    388
sms     292
data    150
Name: item, dtype: int64

In [ ]:
#
Q1. 전체 데이터 중에서 item의 data의 수가 몇 개인가요?
Q2. 전체 데이터 중에서 duration의 값을 참조하여 가장 긴 사용시간을 찾아보세요
Q3. 전체 데이터 중에서 통화(item에서 call)인 값들의 사용시간(duration)의 합은?
Q4. 전체 데이터 중에서 각 달에 얼마나 많은 건수가 있는지 확인해보세요.

In [18]:
# Q1
data["item"].value_counts()["data"]

150

In [19]:
data["item"].value_counts()[2]

150

In [21]:
data["item"].count()

830

In [25]:
# Q2
data["duration"][data["item"]=="call"].sum()

92321.0

In [26]:
data["month"].value_counts()

2014-11    230
2015-01    205
2014-12    157
2015-02    137
2015-03    101
Name: month, dtype: int64

In [27]:
data["duration"].max()

10528.0

In [31]:
for i in data["month"].unique():
    data[data["month"]==i]
#data[data["month"]=="2014-11"]
~~~~~

SyntaxError: invalid syntax (<ipython-input-31-b48800c5c9e0>, line 4)

In [32]:
data.groupby(["month"])

In [33]:
data.groupby(["month"]).groups.keys()

dict_keys(['2014-11', '2014-12', '2015-01', '2015-02', '2015-03'])

In [36]:
data.groupby(["month"]).groups.values()

dict_values([Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            220, 221, 222, 223, 224, 225, 226, 227, 229, 230],
           dtype='int64', length=230), Int64Index([228, 231, 232, 233, 234, 235, 236, 237, 238, 239,
            ...
            377, 378, 379, 380, 382, 383, 384, 385, 387, 388],
           dtype='int64', length=157), Int64Index([381, 386, 389, 390, 391, 392, 393, 394, 395, 396,
            ...
            583, 584, 585, 587, 588, 589, 590, 591, 592, 593],
           dtype='int64', length=205), Int64Index([577, 586, 594, 595, 596, 597, 598, 599, 600, 601,
            ...
            719, 720, 721, 722, 723, 724, 725, 726, 727, 728],
           dtype='int64', length=137), Int64Index([729, 730, 731, 732, 733, 734, 735, 736, 737, 738,
            ...
            820, 821, 822, 823, 824, 825, 826, 827, 828, 829],
           dtype='int64', length=101)])

In [37]:
data.groupby(["month"]).groups["2014-11"]

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            220, 221, 222, 223, 224, 225, 226, 227, 229, 230],
           dtype='int64', length=230)

In [39]:
for name, group in data.groupby("month"):
    print(name)
    print(group)
    print("-----")

2014-11
     index            date  duration  item    month   network network_type
0        0  15/10/14 06:58    34.429  data  2014-11      data         data
1        1  15/10/14 06:58    13.000  call  2014-11  Vodafone       mobile
2        2  15/10/14 14:46    23.000  call  2014-11    Meteor       mobile
3        3  15/10/14 14:48     4.000  call  2014-11     Tesco       mobile
4        4  15/10/14 17:27     4.000  call  2014-11     Tesco       mobile
..     ...             ...       ...   ...      ...       ...          ...
225    225  12/11/14 19:18     1.000   sms  2014-11     Three       mobile
226    226  12/11/14 19:18     1.000   sms  2014-11     Three       mobile
227    227  12/11/14 19:20     1.000   sms  2014-11  Vodafone       mobile
229    229  13/11/14 22:30     1.000   sms  2014-11     Three       mobile
230    230  13/11/14 22:31     1.000   sms  2014-11  Vodafone       mobile

[230 rows x 7 columns]
-----
2014-12
     index            date  duration  item    month    network network_type
228    228  13/11/14 06:58    34.429  data  2014-12       data         data
231    231  14/11/14 06:58    34.429  data  2014-12       data         data
232    232  14/11/14 17:24   124.000  call  2014-12  voicemail    voicemail
233    233  14/11/14 17:28     1.000   sms  2014-12   Vodafone       mobile
234    234  15/11/14 06:58    34.429  data  2014-12       data         data
..     ...             ...       ...   ...      ...        ...          ...
383    383  14/12/14 02:05    14.000  call  2014-12   landline     landline
384    384  14/12/14 02:07     8.000  call  2014-12   landline     landline
385    385  14/12/14 02:09    74.000  call  2014-12   landline     landline
387    387  14/12/14 15:28    59.000  call  2014-12  voicemail    voicemail
388    388  14/12/14 19:54    25.000  call  2014-12      Three       mobile

[157 rows x 7 columns]
-----
2015-01
     index            date  duration  item    month   network network_type
381    381  13/12/14 06:58    34.429  data  2015-01      data         data
386    386  14/12/14 06:58    34.429  data  2015-01      data         data
389    389  15/12/14 06:58    34.429  data  2015-01      data         data
390    390  15/12/14 19:56     1.000   sms  2015-01     Three       mobile
391    391  15/12/14 19:58     1.000   sms  2015-01     Three       mobile
..     ...             ...       ...   ...      ...       ...          ...
589    589  14/01/15 20:47    36.000  call  2015-01     Three       mobile
590    590  14/01/15 23:34     1.000   sms  2015-01  Vodafone       mobile
591    591  14/01/15 23:34     1.000   sms  2015-01  Vodafone       mobile
592    592  14/01/15 23:35     1.000   sms  2015-01     Three       mobile
593    593  14/01/15 23:36     1.000   sms  2015-01     Three       mobile

[205 rows x 7 columns]
-----
2015-02
     index            date  duration  item    month   network network_type
577    577  13/01/15 06:58    34.429  data  2015-02      data         data
586    586  14/01/15 06:58    34.429  data  2015-02      data         data
594    594  15/01/15 06:58    34.429  data  2015-02      data         data
595    595  15/01/15 10:36    28.000  call  2015-02     Three       mobile
596    596  15/01/15 12:23     1.000   sms  2015-02   special      special
..     ...             ...       ...   ...      ...       ...          ...
724    724  10/02/15 00:24     1.000   sms  2015-02  Vodafone       mobile
725    725  10/02/15 06:58    34.429  data  2015-02      data         data
726    726  10/02/15 21:40     1.000   sms  2015-02  Vodafone       mobile
727    727  11/02/15 06:58    34.429  data  2015-02      data         data
728    728  12/02/15 06:58    34.429  data  2015-02      data         data

[137 rows x 7 columns]
-----
2015-03
     index            date  duration  item    month   network network_type
729    729  12/02/15 20:15    69.000  call  2015-03  landline     landline
730    730  12/02/15 20:51    86.000  call  2015-03     Tesco       mobile
731    731  13/02/15 06:58    34.429  data  2015-03      data         data
732    732  13/02/15 10:58   451.000  call  2015-03  Vodafone       mobile
733    733  13/02/15 21:13     8.000  call  2015-03  Vodafone       mobile
..     ...             ...       ...   ...      ...       ...          ...
825    825  13/03/15 00:38     1.000   sms  2015-03     world        world
826    826  13/03/15 00:39     1.000   sms  2015-03  Vodafone       mobile
827    827  13/03/15 06:58    34.429  data  2015-03      data         data
828    828  14/03/15 00:13     1.000   sms  2015-03     world        world
829    829  14/03/15 00:16     1.000   sms  2015-03     world        world

[101 rows x 7 columns]
-----

In [40]:
data.groupby("month").first()

         index            date  duration  item   network network_type
month
2014-11      0  15/10/14 06:58    34.429  data      data         data
2014-12    228  13/11/14 06:58    34.429  data      data         data
2015-01    381  13/12/14 06:58    34.429  data      data         data
2015-02    577  13/01/15 06:58    34.429  data      data         data
2015-03    729  12/02/15 20:15    69.000  call  landline     landline

In [45]:
data.groupby("month").sum() # mean()

          index   duration
month
2014-11   26337  26639.441
2014-12   48362  14641.870
2015-01  100259  18223.299
2015-02   90398  15522.299
2015-03   78679  22750.441

In [48]:
data["month"].value_counts()

2014-11    230
2015-01    205
2014-12    157
2015-02    137
2015-03    101
Name: month, dtype: int64

In [50]:
data.groupby("month")["date"].count()

month
2014-11    230
2014-12    157
2015-01    205
2015-02    137
2015-03    101
Name: date, dtype: int64

In [ ]:
Q) item의 값이 call인 데이터 중에서(-->전체 데이터 주 ㅇ원하는 조건에 맞게 추리기)
통신사별로(network)(-->그 데이터를 통신사별로 묶어서 생각하겠다)
duration값의 총 합을 보고자 함(-->최종적으로 보고자 하는 값)

In [54]:
data.groupby("network")["duration"].sum()

network
Meteor        7233.00
Tesco        13841.00
Three        36551.00
Vodafone     14770.00
data          5164.35
landline     18433.00
special          3.00
voicemail     1775.00
world            7.00
Name: duration, dtype: float64

In [57]:
data[data["item"]=="call"].groupby("network")["duration"].sum()

network
Meteor        7200.0
Tesco        13828.0
Three        36464.0
Vodafone     14621.0
landline     18433.0
voicemail     1775.0
Name: duration, dtype: float64

In [56]:
data.groupby(["month","item"])["date"].count()

month    item
2014-11  call    107
         data     29
         sms      94
2014-12  call     79
         data     30
         sms      48
2015-01  call     88
         data     31
         sms      86
2015-02  call     67
         data     31
         sms      39
2015-03  call     47
         data     29
         sms      25
Name: date, dtype: int64

In [58]:
# 기준 : month-item
#보고자 하는 값 : duration, network_type, date
#duration -> 합, network_type -> 건수, date -> 제일 처음 값

data.groupby(["month","item"]).count()

              index  date  duration  network  network_type
month   item
2014-11 call    107   107       107      107           107
        data     29    29        29       29            29
        sms      94    94        94       94            94
2014-12 call     79    79        79       79            79
        data     30    30        30       30            30
        sms      48    48        48       48            48
2015-01 call     88    88        88       88            88
        data     31    31        31       31            31
        sms      86    86        86       86            86
2015-02 call     67    67        67       67            67
        data     31    31        31       31            31
        sms      39    39        39       39            39
2015-03 call     47    47        47       47            47
        data     29    29        29       29            29
        sms      25    25        25       25            25

In [60]:
data.groupby(["month","item"]).agg({"duration":"sum",
                                     "network_type" : "count",
                                     "date" : "first"
                                    })

               duration  network_type            date
month   item
2014-11 call  25547.000           107  15/10/14 06:58
        data    998.441            29  15/10/14 06:58
        sms      94.000            94  16/10/14 22:18
2014-12 call  13561.000            79  14/11/14 17:24
        data   1032.870            30  13/11/14 06:58
        sms      48.000            48  14/11/14 17:28
2015-01 call  17070.000            88  15/12/14 20:03
        data   1067.299            31  13/12/14 06:58
        sms      86.000            86  15/12/14 19:56
2015-02 call  14416.000            67  15/01/15 10:36
        data   1067.299            31  13/01/15 06:58
        sms      39.000            39  15/01/15 12:23
2015-03 call  21727.000            47  12/02/15 20:15
        data    998.441            29  13/02/15 06:58
        sms      25.000            25  19/02/15 18:46

In [64]:
pd.pivot_table(data,
               index = ["month","item"], # 가로줄 세팅
              # values = ["duration", "network_type", "date"], # 세로줄 세팅
               aggfunc = {
                   "duration" : "sum",
                   "network_type" : "count",
                   "date" : "first"
              })

                        date   duration  network_type
month   item
2014-11 call  15/10/14 06:58  25547.000           107
        data  15/10/14 06:58    998.441            29
        sms   16/10/14 22:18     94.000            94
2014-12 call  14/11/14 17:24  13561.000            79
        data  13/11/14 06:58   1032.870            30
        sms   14/11/14 17:28     48.000            48
2015-01 call  15/12/14 20:03  17070.000            88
        data  13/12/14 06:58   1067.299            31
        sms   15/12/14 19:56     86.000            86
2015-02 call  15/01/15 10:36  14416.000            67
        data  13/01/15 06:58   1067.299            31
        sms   15/01/15 12:23     39.000            39
2015-03 call  12/02/15 20:15  21727.000            47
        data  13/02/15 06:58    998.441            29
        sms   19/02/15 18:46     25.000            25